case/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationModel	qmom; 

// --- Class method parameters ---
classMethodCoeffs
{
	dm					dm [0 1 0 0 0 0 0]  0.005;
	ResidualAlphaForDsauter		ResidualAlphaForDsauter [0 0 0 0 0 0 0]  1e-6;
        ResidualAlphaForAdjust		ResidualAlphaForAdjust [0 0 0 0 0 0 0]  1e-8;
	ResidualAlphaForCorrect		ResidualAlphaForCorrect [0 0 0 0 0 0 0]  1e-6; 
	Nc					7; 									// max is 25 classes 
	h0					h0 [0 1 0 0 0 0 0]  1e-4; 
	hf					hf [0 1 0 0 0 0 0]  1e-8; 
	beta1	      	beta1 [0 0 0 0 0 0 0]  0.1; 
	beta2	      	beta2 [0 0 0 0 0 0 0]  0.1; 
	betaPB			betaPB [0 0 0 0 0 0 0]  0.1; 
	k1					k1 [0 0 0 0 0 0 0]  1.0; 
	sigma 			sigma  [0 0 0 0 0 0 0]  0.07; // water-air system
	breakCoeff		breakCoeff [0 0 0 0 0 0 0]  0.5;
	coalCoeff		coalCoeff [0 0 0 0 0 0 0]  0.5;
	S					S [0 0 0 0 0 0 0] 2;
	dMin				dMin [0 1 0 0 0 0 0] 0.1e-3;
	dMax				dMax [0 1 0 0 0 0 0] 0.01;
	maxIters		   200; 
	loopTolerance  1E-9;
}


// --- Quadrature method of moments parameters (TO BE AVAILABLE asap)
qmomCoeffs
{
	dm					dm [0 1 0 0 0 0 0]  0.005;
	ResidualAlphaForDsauter		ResidualAlphaForDsauter [0 0 0 0 0 0 0]  1e-6;
        ResidualAlphaForAdjust		ResidualAlphaForAdjust [0 0 0 0 0 0 0]  1e-8;
	ResidualAlphaForCorrect		ResidualAlphaForCorrect [0 0 0 0 0 0 0]  1e-6; 
	Nm					6; 
        nodes                                   3;
	h0					h0 [0 1 0 0 0 0 0]  1e-4; 
	hf					hf [0 1 0 0 0 0 0]  1e-8; 
	beta1	      	beta1 [0 0 0 0 0 0 0]  0.1; 
	beta2	      	beta2 [0 0 0 0 0 0 0]  0.1; 
	betaPB			betaPB [0 0 0 0 0 0 0]  0.1; 
	k1					k1 [0 0 0 0 0 0 0]  1.0; 
	sigma 			sigma  [0 0 0 0 0 0 0]  0.07; // water-air system
	breakCoeff		breakCoeff [0 0 0 0 0 0 0]  0.5;
	coalCoeff		coalCoeff [0 0 0 0 0 0 0]  0.5;
	S					S [0 0 0 0 0 0 0] 2;
	dMin				dMin [0 1 0 0 0 0 0] 0.1e-3;
	dMax				dMax [0 1 0 0 0 0 0] 0.01;
	maxIters		   200; 
	loopTolerance  1E-9;
}


// --- Bubble breakup models selector
breakupModels
{
   modelName 		LuoAndSvendsen;;
   
   LuoAndSvendsenCoeffs
   {
		rhob        rhob [1 -3 0 0 0 0 0] 	 1000.0;		// liquid density 
		rhoa			rhoa [1 -3 0 0 0 0 0] 	 1.2;			// gas density
		sigma       sigma [1 0 -2 0 0 0 0]   0.07;		// surface tension liquid-gas
		k           k [0 0 1 0 0 0 0] 		 0.9238;		// model parameter				
		beta       									 2.12; 		// model parameter
   }
   

}

// --- bubble coalscence models selector
coalescenceModels
{
	modelName		LuoAndSvendsen;
	
	LuoAndSvendsenCoeffs
   {
		rhob        rhob [1 -3 0 0 0 0 0] 	 1000.0;		// liquid density 
		rhoa			rhoa [1 -3 0 0 0 0 0] 	 1.2;			// gas density
		sigma       sigma [1 0 -2 0 0 0 0]   0.07;		// surface tension liquid-gas
   }
   

}

// ************************************************************************* //
